import { slideDataType } from "./types";

export const sliderData: slideDataType[] = [
  {
    id: 1,
    textSide: {
      title: "حول حلمك إلى واقع.. ابنِ متجرك الإلكتروني الخاص بك معنا!",
      description:
        "هل لديك منتجات أو خدمات مميزة ترغب في عرضها للعالم؟ هل تبحث عن طريقة فعالة لزيادة مبيعاتك وتوسيع نطاق عملك؟ نحن هنا لمساعدتك في تحقيق ذلك",
    },
    ImageSide: {
      title: "الوصول إلى جمهور أوسع",
      description:
        "عرض منتجاتك وخدماتك لعملاء جدد على مدار الساعة طوال أيام الأسبوع.",
    },
  },
  {
    id: 2,
    textSide: {
      title: " ابنِ متجرك الإلكتروني وصولاً إلى قمة محركات البحث",
      description:
        "نقدم لك خدمة متكاملة لإنشاء متاجر إلكترونية مُحسّنة لمحركات البحث (SEO) منذ البداية. هذا يعني أن متجرك سيكون جاهزًا للظهور في أعلى نتائج البحث، مما يجذب المزيد من الزوار ويحولهم إلى عملاء.",
    },
    ImageSide: {
      title: "بناء هيكل موقع قوي",
      description:
        "نعمل على تحسين سرعة تحميل موقعك، مما يؤثر إيجابًا على تجربة المستخدم",
    },
  },
  {
    id: 3,
    textSide: {
      title: "ابدع مع تصميم الموشن الجرافيكي الاحترافي لعلامتك التجارية",
      description:
        "نحن في مثلث نقدم لك خدمات تصميم جرافيكي متكاملة لتلبية جميع احتياجاتك التسويقية. سواء كنت بحاجة إلى تصميم شعار جذاب، أو إنشاء مواد تسويقية مبتكرة، أو تصميم واجهة مستخدم مميزة لموقعك الإلكتروني، فإن فريقنا من المصممين المحترفين مستعد لتقديم أفضل الحلول.",
    },
    ImageSide: {
      title: "تصميم مخصص",
      description: "نقدم لك تصاميم مخصصة تمامًا تناسب احتياجاتك وأهدافك.",
    },
  },
  {
    id: 4,
    textSide: {
      title: "ابدع في عالم التواصل الاجتماعي مع خدماتنا لإدارة السوشيال ميديا",
      description:
        "هل ترغب في الوصول إلى جمهور أوسع وتعزيز تفاعلك مع عملائك؟ نحن نقدم لك خدمات إدارة حسابات التواصل الاجتماعي بشكل احترافي، لنصنع لك حضورًا قويًا على منصات التواصل الاجتماعي المختلفة.",
    },
    ImageSide: {
      title: "تحسين علامتك التجارية",
      description:
        "إدارة الحسابات بشكل احترافي يعزز من مصداقية علامتك التجارية",
    },
  },
  {
    id: 5,
    textSide: {
      title: "شراء الإعلانات , استهدف جمهورك وزد مبيعاتك (Media Buying)",
      description:
        "نحن في مثلث نقدم لك خدمة شراء إعلانات احترافية، حيث نعمل على تحديد أفضل القنوات الإعلانية التي تناسب منتجاتك أو خدماتك، ونقوم بإدارة حملاتك الإعلانية بشكل فعال لتحقيق أقصى استفادة من ميزانيتك.",
    },
    ImageSide: {
      title: "قياس الأداء",
      description: " تتبع أداء حملاتك الإعلانية وتحليل النتائج.",
    },
  },
  {
    id: 6,
    textSide: {
      title: "ابدع مع تصميم  الهوية البصرية ",
      description:
        "نحن في مثلث نقدم لك خدمات تصميم جرافيكي متكاملة لتلبية جميع احتياجاتك التسويقية. سواء كنت بحاجة إلى تصميم شعار جذاب، أو إنشاء مواد تسويقية مبتكرة، أو تصميم واجهة مستخدم مميزة لموقعك الإلكتروني، فإن فريقنا من المصممين المحترفين مستعد لتقديم أفضل الحلول.",
    },
    ImageSide: {
      title: "تصميم مخصص",
      description: "نقدم لك تصاميم مخصصة تمامًا تناسب احتياجاتك وأهدافك.",
    },
  },
];
